core/app/Providers/AppServiceProvider.php

select * from `frontends` where `data_keys` = 'seo.data' limit 1
---
    public function boot()
    {
        $activeTemplate = activeTemplate();
        $currency = Currency::select('currency_code', 'currency_symbol')->where('status', '=', 1)->where('is_default', '=', 1)->first();
        $general = GeneralSetting::with('currency')->first();

        $viewShare['general'] = $general ? $general : '';
        $viewShare['currency'] = $currency ? $currency : 'TL';

        $viewShare['languages'] = Language::all();

        $viewShare['activeTemplate'] = $activeTemplate ? $activeTemplate : '';
        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        view()->share($viewShare);
        view()->composer('partials.seo', function ($view) {
            $seo = Frontend::where('data_keys', 'seo.data')->first();