core/app/Http/Controllers/Front/DashboardController.php

select * from `message_users` where `from` = 3 and `is_deleted_from` = 0 or `to` = 3 and `is_deleted_to` = 0 order by `date` desc
select * from `message_users` where `from` = 3 or `to` = 3 and `is_deleted_from` = 0 and `is_deleted_to` = 0 and `is_important_to` = 1 and `is_important_from` = 0 order by `date` desc
---
    public function chat()
    {
        $message_users = MessageUser::where('from', Auth::guard('advertiser')->user()->id)->where('is_deleted_from', 0)
            ->orWhere('to', Auth::guard('advertiser')->user()->id)->where('is_deleted_to', 0)
            ->orderBy('date', 'desc')->get();
        $importent_users = MessageUser::where('from', Auth::guard('advertiser')->user()->id)->orWhere('to', Auth::guard('advertiser')->user()->id)
            ->where('is_deleted_from', 0)->where('is_deleted_to', 0)->where('is_important_to', 1)->where('is_important_from', 0)
            ->orderBy('date', 'desc')->get();