core/app/Http/Controllers/Front/HomeController.php

select * from `categories` where (`parent_id` != 0 or `parent_id` is null) limit 20 offset 0
select count(*) as aggregate from `categories` where (`parent_id` != 0 or `parent_id` is null)
select * from `advertisement_interest_advertisement` where `visitor_id` = 3
select * from `ad_images` where `ad_images`.`advertisement_id` in (122, 123)
select `id`, `title` from `cities` where `cities`.`id` in (3) and `status` = 1
---
    public function home()
    {
        // $MAC  = exec('getmac');
        // $visitorDeviceMac = strtok($MAC, ' ');
        $data['pageTitle'] = 'Home';
        $data['main_category'] = Category::with('ads', 'subCategories')->has('ads')->parent()->active()->orderBy('id', 'desc')->paginate(getPaginate());
        $data['sub_category'] =  Category::where(function ($query) {
            $query->where('parent_id', '!=', 0)->orWhereNull('parent_id');
        })->paginate(getPaginate());
        $user = Auth::guard('advertiser')->user();
        if ($user) {
            $data['mac_wise_ads'] = InterestAdvertisement::with('ad')->where('visitor_id', $user->id)->get(); //pivot table ads
        }
        $data['featured_ads'] = Advertisement::featured()->with(
            [
                'city' => function ($query) {
                    $query->select('id', 'title')->where('status', 1);
                },
                'images'
            ]
        )->where('created_at', '<=', Carbon::now())
            ->where('feature_expire_date', '>=', Carbon::now())
            ->orderBy('created_at', 'desc')
            ->take(12)
            ->get();

select `currency_code`, `currency_symbol` from `currencies` where `status` = 1 and `is_default` = 1 limit 1
select * from `advertisements` where `is_featured` = 0 order by `id` desc limit 8
---
    function loadMore(Request $request)
    {
        $advertiser = Auth::guard('advertiser')->user();
        // dd($advertiser);
        $currency = Currency::select('currency_code', 'currency_symbol')->where('status', '=', 1)->where('is_default', '=', 1)->first();
        if ($request->ajax()) {
            if ($request->id > 0) {
                $data = Advertisement::where('id', '<', $request->id)->where('is_featured', '=', 0)->orderBy('id', 'DESC')->limit(8)->get();
            } else {
                $data = Advertisement::orderBy('id', 'DESC')->where('is_featured', '=', 0)->limit(8)->get();

update `messages` set `is_read` = 1, `messages`.`updated_at` = '2023-01-22 07:25:38' where (`from` = 4 and `to` = 3)
select * from `messages` where `from` = 4 and `to` = 3 and `deleted_to` = 0 or `from` = 3 and `to` = 4 and `deleted_from` = 0
select * from `advertisers` where `advertisers`.`id` = 4 and `advertisers`.`deleted_at` is null limit 1
---
    public function getMessage(int $user_id)
    {
        // dd($user_id);
        $my_id = Auth::guard('advertiser')->user()->id;
        Message::where(['from' => $user_id, 'to' => $my_id])->update(['is_read' => 1]);

        $messages = Message::where('from', $user_id)->where('to', $my_id)->where('deleted_to', 0)
            ->orWhere('from', $my_id)->where('to', $user_id)->where('deleted_from', 0)->get();
        // dd($messages);
        $user = Advertiser::findOrFail($user_id);
        $myId = Advertiser::findOrFail($my_id);