core/app/Http/Controllers/Front/HomeController.php

select * from `messages` where `from` = '3' and `is_read` = 0 and `deleted_from` = 0 and `deleted_to` = 0 order by `created_at` desc
select * from `message_users` where `from` = 3 or `to` = 80 and `is_deleted_from` = 0 and `is_deleted_to` = 0 order by `date` desc
---
    public function unreadMessage($id)
    {
        $check_unread = Message::where('from', $id)
            ->where('is_read', 0)->where('deleted_from', 0)->where('deleted_to', 0)
            ->orderBy('created_at', 'desc')->get();
            $unread_message = [];
        foreach($check_unread as $unread) {
            $messages = MessageUser::where('from', $unread->from)->orWhere('to', $unread->id)
            ->where('is_deleted_from', 0)->where('is_deleted_to', 0)
            ->orderBy('date', 'desc')->get();